<?php

function insert_table_data($conn, $table_name)
{
  $createTableFlag = false;
  $sql = "select * from `$table_name`";
  $stmt = $conn->prepare($sql);
  // $stmt->bindParam(":table_name", $table_name);
  $result = $stmt->execute();
  $stmt->setFetchMode(PDO::FETCH_NUM);
  $count = $stmt->rowCount();

  //테이블이 있는지 없는지 확인
  $createTableFlag = ($count > 0) ? true : false;
  if ($createTableFlag == false) {
    switch ($table_name) {
      case 'member':
        $sql = "INSERT INTO `member` VALUES (null, 'ffffff', 'ffffff', 'ffff@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff1', 'ffffff', 'ffff1@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff2', 'ffffff', 'ffff2@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff3', 'ffffff', 'ffff3@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff4', 'ffffff', 'ffff4@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff5', 'ffffff', 'ffff5@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff6', 'ffffff', 'ffff6@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff7', 'ffffff', 'ffff7@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff8', 'ffffff', 'ffff8@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14'),
          (null, 'ffffff9', 'ffffff', 'ffff9@fff.fff', 'ffff', '12345', '서울 성동구 왕십리로 315(행당동, 한동타워)', '8층 강의실', '1.png', '::1', '1', '2023-06-25 18:20:30', '2023-06-27 21:15:14')";
        break;

      case 'message':
        $sql = "INSERT INTO `message` VALUES (null, 'ffffff', 'admin01', '홈페이지 오픈 축하드려요', '축하드립니다!', '2023-06-01 10:20:30'),
          (null, 'ffffff', 'admin01', '상품 언제 도착하나요?', '구매한지가 일주일이 넘었는데 무슨 만들어서 오나요?', '2023-06-01 10:20:30'),
          (null, 'ffffff', 'admin01', '상품 문제가 있네요', '무슨 상품이 이런가요;; 환불은 어떻게 하나요?', '2023-06-01 10:20:30')";
        break;

      case 'image_board':
        $sql = "INSERT INTO `image_board` VALUES (null, 'ffffff', 'ffffff', '책상 너무 맘에드네요!', '너무 맘에듭니다!!', 5, '2023-06-01 10:20:30', '1.png', 'image/png', '2023_06_29_11_55_12_1.png'),
          (null, 'ffffff', 'ffffff', '쇼파 너무 맘에드네요!', '너무 맘에듭니다!!', 5, '2023-06-01 10:20:30', '3.png', 'image/png', '2023_06_29_12_18_26_3.png'),
          (null, 'ffffff', 'ffffff', '침대 너무 맘에드네요!', '너무 맘에듭니다!!', 5, '2023-06-01 10:20:30', '4.png', 'image/png', '2023_06_29_12_18_52_4.png'),
          (null, 'ffffff', 'ffffff', '장롱 너무 맘에드네요!', '너무 맘에듭니다!!', 5, '2023-06-01 10:20:30', '7.png', 'image/png', '2023_06_29_12_19_10_7.png'),
          (null, 'ffffff', 'ffffff', '의자 너무 맘에드네요!', '너무 맘에듭니다!!', 5, '2023-06-01 10:20:30', '2.png', 'image/png', '2023_06_29_14_48_04_2.png'),
          (null, 'ffffff', 'ffffff', '식탁 너무 맘에드네요!', '너무 맘에듭니다!!', 5, '2023-06-01 10:20:30', '5.png', 'image/png', '2023_06_29_14_48_15_5.png'),
          (null, 'ffffff', 'ffffff', '서랍장 너무 맘에드네요!', '너무 맘에듭니다!!', 5, '2023-06-01 10:20:30', '6.png', 'image/png', '2023_06_29_14_48_24_6.png')";
        break;

      case 'image_board_ripple':
        $sql = "INSERT INTO `image_board_ripple` VALUES (null, 1, 'ffffff', 'ffffff', '오 저도 한번 구매 해봐야겠어요!!', '2023-06-01 10:20:30'),
        (null, 2, 'ffffff', 'ffffff', '오 저도 한번 구매 해봐야겠어요!!', '2023-06-01 10:20:30'),
        (null, 3, 'ffffff', 'ffffff', '오 저도 한번 구매 해봐야겠어요!!', '2023-06-01 10:20:30'),
        (null, 4, 'ffffff', 'ffffff', '오 저도 한번 구매 해봐야겠어요!!', '2023-06-01 10:20:30'),
        (null, 5, 'ffffff', 'ffffff', '오 저도 한번 구매 해봐야겠어요!!', '2023-06-01 10:20:30'),
        (null, 6, 'ffffff', 'ffffff', '오 저도 한번 구매 해봐야겠어요!!', '2023-06-01 10:20:30'),
        (null, 7, 'ffffff', 'ffffff', '오 저도 한번 구매 해봐야겠어요!!', '2023-06-01 10:20:30')";
        break;

      case 'product':
        $sql = "insert into product values (null,'골든 쇼파', '3', '150,000', '120,000','푹신푹신한 쇼파입니다','3.png','image/png','2023_06_29_12_14_24_3.png','2023-06-01 10:20:30'),
          (null,'골든 쇼파', '3', '150,000', '120,000','푹신푹신한 쇼파입니다','3.png','image/png','2023_06_29_12_14_24_3.png','2023-06-01 10:20:30'),
          (null,'골든 쇼파', '3', '150,000', '120,000','푹신푹신한 쇼파입니다','3.png','image/png','2023_06_29_12_14_24_3.png','2023-06-01 10:20:30'),
          (null,'골든 쇼파', '3', '150,000', '120,000','푹신푹신한 쇼파입니다','3.png','image/png','2023_06_29_12_14_24_3.png','2023-06-01 10:20:30'),
          (null,'골든 쇼파', '3', '150,000', '120,000','푹신푹신한 쇼파입니다','3.png','image/png','2023_06_29_12_14_24_3.png','2023-06-01 10:20:30'),
          (null,'골든 쇼파', '3', '150,000', '120,000','푹신푹신한 쇼파입니다','3.png','image/png','2023_06_29_12_14_24_3.png','2023-06-01 10:20:30'),
          (null,'책상', '1', '100,000', '80,000','심플한 책상입니다','1.png','image/png','2023_06_29_11_48_38_1.png','2023-06-01 10:20:30'),
          (null,'책상', '1', '100,000', '80,000','심플한 책상입니다','1.png','image/png','2023_06_29_11_48_38_1.png','2023-06-01 10:20:30'),
          (null,'책상', '1', '100,000', '80,000','심플한 책상입니다','1.png','image/png','2023_06_29_11_48_38_1.png','2023-06-01 10:20:30'),
          (null,'책상', '1', '100,000', '80,000','심플한 책상입니다','1.png','image/png','2023_06_29_11_48_38_1.png','2023-06-01 10:20:30'),
          (null,'책상', '1', '100,000', '80,000','심플한 책상입니다','1.png','image/png','2023_06_29_11_48_38_1.png','2023-06-01 10:20:30'),
          (null,'책상', '1', '100,000', '80,000','심플한 책상입니다','1.png','image/png','2023_06_29_11_48_38_1.png','2023-06-01 10:20:30'),
          (null,'침대', '4', '500,000', '490,000','푹신한 침대입니다','4.png','image/png','2023_06_29_11_49_12_4.png','2023-06-01 10:20:30'),
          (null,'침대', '4', '500,000', '490,000','푹신한 침대입니다','4.png','image/png','2023_06_29_11_49_12_4.png','2023-06-01 10:20:30'),
          (null,'침대', '4', '500,000', '490,000','푹신한 침대입니다','4.png','image/png','2023_06_29_11_49_12_4.png','2023-06-01 10:20:30'),
          (null,'침대', '4', '500,000', '490,000','푹신한 침대입니다','4.png','image/png','2023_06_29_11_49_12_4.png','2023-06-01 10:20:30'),
          (null,'침대', '4', '500,000', '490,000','푹신한 침대입니다','4.png','image/png','2023_06_29_11_49_12_4.png','2023-06-01 10:20:30'),
          (null,'침대', '4', '500,000', '490,000','푹신한 침대입니다','4.png','image/png','2023_06_29_11_49_12_4.png','2023-06-01 10:20:30'),
          (null,'장롱', '7', '300,000', '270,000','깔끔한 장롱입니다','7.png','image/png','2023_06_29_11_50_08_7.png','2023-06-01 10:20:30'),
          (null,'장롱', '7', '300,000', '270,000','깔끔한 장롱입니다','7.png','image/png','2023_06_29_11_50_08_7.png','2023-06-01 10:20:30'),
          (null,'장롱', '7', '300,000', '270,000','깔끔한 장롱입니다','7.png','image/png','2023_06_29_11_50_08_7.png','2023-06-01 10:20:30'),
          (null,'장롱', '7', '300,000', '270,000','깔끔한 장롱입니다','7.png','image/png','2023_06_29_11_50_08_7.png','2023-06-01 10:20:30'),
          (null,'장롱', '7', '300,000', '270,000','깔끔한 장롱입니다','7.png','image/png','2023_06_29_11_50_08_7.png','2023-06-01 10:20:30'),
          (null,'장롱', '7', '300,000', '270,000','깔끔한 장롱입니다','7.png','image/png','2023_06_29_11_50_08_7.png','2023-06-01 10:20:30'),
          (null,'의자', '2', '50,000', '30,000','앉기 좋은 의자입니다','2.png','image/png','2023_06_29_14_42_05_2.png','2023-06-01 10:20:30'),
          (null,'의자', '2', '50,000', '30,000','앉기 좋은 의자입니다','2.png','image/png','2023_06_29_14_42_05_2.png','2023-06-01 10:20:30'),
          (null,'의자', '2', '50,000', '30,000','앉기 좋은 의자입니다','2.png','image/png','2023_06_29_14_42_05_2.png','2023-06-01 10:20:30'),
          (null,'의자', '2', '50,000', '30,000','앉기 좋은 의자입니다','2.png','image/png','2023_06_29_14_42_05_2.png','2023-06-01 10:20:30'),
          (null,'의자', '2', '50,000', '30,000','앉기 좋은 의자입니다','2.png','image/png','2023_06_29_14_42_05_2.png','2023-06-01 10:20:30'),
          (null,'의자', '2', '50,000', '30,000','앉기 좋은 의자입니다','2.png','image/png','2023_06_29_14_42_05_2.png','2023-06-01 10:20:30'),
          (null,'식탁', '5', '150,000', '139,999','넓은 식탁입니다','5.png','image/png','2023_06_29_14_42_40_5.png','2023-06-01 10:20:30'),
          (null,'식탁', '5', '150,000', '139,999','넓은 식탁입니다','5.png','image/png','2023_06_29_14_42_40_5.png','2023-06-01 10:20:30'),
          (null,'식탁', '5', '150,000', '139,999','넓은 식탁입니다','5.png','image/png','2023_06_29_14_42_40_5.png','2023-06-01 10:20:30'),
          (null,'식탁', '5', '150,000', '139,999','넓은 식탁입니다','5.png','image/png','2023_06_29_14_42_40_5.png','2023-06-01 10:20:30'),
          (null,'식탁', '5', '150,000', '139,999','넓은 식탁입니다','5.png','image/png','2023_06_29_14_42_40_5.png','2023-06-01 10:20:30'),
          (null,'식탁', '5', '150,000', '139,999','넓은 식탁입니다','5.png','image/png','2023_06_29_14_42_40_5.png','2023-06-01 10:20:30'),
          (null,'서랍장', '6', '180,000', '165,980','수납하기 좋은 서랍장입니다','6.png','image/png','2023_06_29_14_43_17_6.png','2023-06-01 10:20:30'),
          (null,'서랍장', '6', '180,000', '165,980','수납하기 좋은 서랍장입니다','6.png','image/png','2023_06_29_14_43_17_6.png','2023-06-01 10:20:30'),
          (null,'서랍장', '6', '180,000', '165,980','수납하기 좋은 서랍장입니다','6.png','image/png','2023_06_29_14_43_17_6.png','2023-06-01 10:20:30'),
          (null,'서랍장', '6', '180,000', '165,980','수납하기 좋은 서랍장입니다','6.png','image/png','2023_06_29_14_43_17_6.png','2023-06-01 10:20:30'),
          (null,'서랍장', '6', '180,000', '165,980','수납하기 좋은 서랍장입니다','6.png','image/png','2023_06_29_14_43_17_6.png','2023-06-01 10:20:30'),
          (null,'서랍장', '6', '180,000', '165,980','수납하기 좋은 서랍장입니다','6.png','image/png','2023_06_29_14_43_17_6.png','2023-06-01 10:20:30')";
        break;

      case 'notice':
        $sql = "insert into notice values (null, '홈페이지 오픈', '드디어 홈페이지가 오픈하였습니다!!!', null, 'image/png','2023_06_27_15_27_06.png','0','2023-06-27 (15:27)'),
          (null, '상품 구매', '저도 상품 잘 모릅니다..', null, 'image/png','2023_06_27_15_27_06.png','0','2023-06-27 (15:27)'),
          (null, '관리자와 소통', '문의하기 버튼을 눌러서 문의를 주시면 최대한 빠른 시간내에 답변 드리겠습니다.', null, 'image/png','2023_06_27_15_27_06.png','0','2023-06-27 (15:27)')";
        break;

      default:
        //     $sql = "";
        //     print "<script>
        //   alert('해당 $table_name 이 없습니다.')
        // </script>";
        break;
    } // end of switch
    if ($sql != "") {
      $stmt = $conn->prepare($sql);
      $result = $stmt->execute();
      if ($result) {
        print "<script>
              alert('해당 $table_name 테이블에 데이터추가 완료')
            </script>";
      } else {
        print "<script>
            alert('해당 $table_name 테이블이 생성 실패 되었습니다.')
          </script>";
      }
    }
  } // end of if
}
